docs/providers/airblue-ndc-samples/Ancillary NDC API Samples/doAddAncillary_Weightbag_req.xml

<soapenv:Envelope xmlns="http://www.iata.org/IATA/2015/00/2020.1/IATA_OrderChangeRQ" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <IATA_OrderChangeRQ>
            <Party>
            <Sender>
               <TravelAgency>
                  <AgencyID>SELENS</AgencyID>
                  <Name>NDC GATEWAY</Name>
               </TravelAgency>
            </Sender>
         </Party>
         <PayloadAttributes>
            <PrimaryLangID>EN</PrimaryLangID>
         </PayloadAttributes>
         <Request>
            <ChangeOrder>
               <UpdateOrderItem>
                  <AcceptOffer>
                     <SelectedOffer>
                        <OfferRefID>Offer1</OfferRefID>
                        <OwnerCode>4M</OwnerCode>
                        <SelectedOfferItem>
                           <OfferItemRefID>OfferItem-XBAG-5KG</OfferItemRefID>
                           <PaxRefID>ADTPax-403002906</PaxRefID>
                           <SelectedALaCarteOfferItem>
                              <FlightAssociations>
                             <DatedOperatingLegRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</DatedOperatingLegRefID>
                                 <PaxJourneyRefID>AMD-HYD-J1</PaxJourneyRefID>
                                 <PaxSegmentRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentRefID>
                              </FlightAssociations>
                              <Qty>1</Qty>
                           </SelectedALaCarteOfferItem>
                             <SelectedBundleServices>
                                        <SelectedServiceDefinitionRefID>ServiceDef-XBAG-5KG</SelectedServiceDefinitionRefID>
                                        <SelectedServiceRefID>Service-XBAG-5KG</SelectedServiceRefID>
                                    </SelectedBundleServices>
                        </SelectedOfferItem>
                          <SelectedOfferItem>
                           <OfferItemRefID>OfferItem-XBAG-5KG</OfferItemRefID>
                           <PaxRefID>ADTPax-403002906</PaxRefID>
                           <SelectedALaCarteOfferItem>
                              <FlightAssociations>
                                 <DatedOperatingLegRefID>PK998-12Aug-ISBKHI-NDIwNTEzOQ</DatedOperatingLegRefID>
                                 <PaxJourneyRefID>ISB-KHI-J1</PaxJourneyRefID>
                                 <PaxSegmentRefID>PK998-12Aug-ISBKHI-NDIwNTEzOQ</PaxSegmentRefID>
                              </FlightAssociations>
                              <Qty>1</Qty>
                           </SelectedALaCarteOfferItem>
                             <SelectedBundleServices>
                                        <SelectedServiceDefinitionRefID>ServiceDef-XBAG-5KG</SelectedServiceDefinitionRefID>
                                        <SelectedServiceRefID>Service-XBAG-5KG</SelectedServiceRefID>
                                    </SelectedBundleServices>
                        </SelectedOfferItem>
                     </SelectedOffer>
                  </AcceptOffer>
               </UpdateOrderItem>
            </ChangeOrder>
            <DataLists>
                 <OriginDestList>
                  <OriginDest>
                     <DestCode>ISB</DestCode>
                     <OriginCode>KHI</OriginCode>
                     <OriginDestID>OD-KHIISB</OriginDestID>
                     <PaxJourneyRefID>KHI-ISB-J1</PaxJourneyRefID>
                  </OriginDest>
               </OriginDestList>
               <PaxJourneyList>
                  <PaxJourney>
                     <PaxJourneyID>KHI-ISB-J1</PaxJourneyID>
                     <PaxSegmentRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentRefID>
					 <PaxSegmentRefID>S5155-18May-BLRHYD-OTg3NTI3</PaxSegmentRefID>
                  </PaxJourney>
               </PaxJourneyList>
               <PaxList>
                  <Pax>
                     <Birthdate>1974-04-16</Birthdate>
                     <Individual>
                        <TitleName>MS</TitleName>
                        <GivenName>MARYAM</GivenName>
                        <Surname>SHAHBAZINIA</Surname>
                        <GenderCode>F</GenderCode>
                     </Individual>
                     <PaxID>ADTPax-403002906</PaxID>
                     <PTC>ADT</PTC>
                     
                  </Pax>
                  <Pax>
                     <Birthdate>1990-07-03</Birthdate>
                     <Individual>
                        <TitleName>Mr</TitleName>
                        <GivenName>MERI</GivenName>
                        <Surname>aaaaaa</Surname>
                        <GenderCode>M</GenderCode>
                     </Individual>
                     <PaxID>ADTPax-85287343</PaxID>
                     <PTC>ADT</PTC>
                     <ResidenceCountryCode>GB</ResidenceCountryCode>
                  </Pax>
                  <Pax>
                     <Birthdate>1994-11-01</Birthdate>
                     <Individual>
                        <TitleName>Mr</TitleName>
                        <GivenName>MUSTAFA</GivenName>
                        <Surname>bbbbbb</Surname>
                        <GenderCode>M</GenderCode>
                     </Individual>
                     <PaxID>ADTPax-85287344</PaxID>
                     <PTC>ADT</PTC>
                     <ResidenceCountryCode>GB</ResidenceCountryCode>
                  </Pax>
               </PaxList>
               <PaxSegmentList>
                  <PaxSegment>
                     <Arrival>
                      <AircraftScheduledDateTime>2025-08-11T14:55:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>ISB</IATA_LocationCode>
                        <StationName>Islamabad International Airpor</StationName>
                     </Arrival>
                     <CabinType>
                        <CabinTypeCode>Y</CabinTypeCode>
                        <CabinTypeName>ECONOMY</CabinTypeName>
                     </CabinType>
                     <Dep>
                       <AircraftScheduledDateTime>2025-08-11T13:00:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>KHI</IATA_LocationCode>
                        <StationName>Jinnah Intl</StationName>
                     </Dep>
                     <Duration>PT1H55M</Duration>
                     <MarketingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <MarketingCarrierFlightNumberText>368</MarketingCarrierFlightNumberText>
                     </MarketingCarrierInfo>
                     <OperatingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <OperatingCarrierFlightNumberText>368</OperatingCarrierFlightNumberText>
                     </OperatingCarrierInfo>
                     <PaxSegmentID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentID>
                  </PaxSegment>
				   <PaxSegment>
                     <Arrival>
                      <AircraftScheduledDateTime>2025-08-12T07:55:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>KHI</IATA_LocationCode>
                        <StationName>Jinnah Intl</StationName>
                     </Arrival>
                     <CabinType>
                        <CabinTypeCode>Y</CabinTypeCode>
                        <CabinTypeName>ECONOMY</CabinTypeName>
                     </CabinType>
                     <Dep>
                       <AircraftScheduledDateTime>2025-08-12T06:00:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>ISB</IATA_LocationCode>
                        <StationName>Islamabad International Airpor</StationName>
                     </Dep>
                     <Duration>PT1H55M</Duration>
                     <MarketingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <MarketingCarrierFlightNumberText>998</MarketingCarrierFlightNumberText>
                     </MarketingCarrierInfo>
                     <OperatingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <OperatingCarrierFlightNumberText>998</OperatingCarrierFlightNumberText>
                     </OperatingCarrierInfo>
                     <PaxSegmentID>PK998-12Aug-ISBKHI-NDIwNTEzOQ</PaxSegmentID>
                  </PaxSegment>
               </PaxSegmentList>
               <ServiceDefinitionList>
                  <ServiceDefinition>
                     <Desc>
                        <DescText>5 KG</DescText>
                     </Desc>
                     <Name>BAG</Name>
                     <ServiceCode>XBAG</ServiceCode>
                     <ServiceDefinitionID>ServiceDef-XBAG-5KG</ServiceDefinitionID>
                  </ServiceDefinition>
               </ServiceDefinitionList>
            </DataLists>
            <Order>
               <OrderID>800EDS</OrderID>
               <OwnerCode>S5</OwnerCode>
            </Order>
            <OrderChangeParameters>
               <CurParameter>
                  <CurCode>PKR</CurCode>
               </CurParameter>
            </OrderChangeParameters>
         </Request>
      </IATA_OrderChangeRQ>
   </soapenv:Body>
</soapenv:Envelope>